[Balance.Balance_Ep13_RolandTurretTarget InteractiveObjectBalanceDefinition]
DefaultDisplayName=""

[Balance.Pawn_Balance_RolandDeployableTurret AIPawnBalanceDefinition]
PlayThroughs[0]=(DisplayName="Roland Scorpion Castle")
PlayThroughs[1]=(DisplayName="Roland Scorpion Tower")
PlayThroughs[2]=(DisplayName="Roland Scorpio Dome")

[Character.CharClass_RolandDeployableTurret AIClassDefinition]
DefaultDisplayName="Roland the Scorpion"
UBMKilledByMessageString=""

[InteractiveObjects.Ep13_RolandTurretTarget InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[Shield.RolandTurretShieldObjectDefinition InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[Skills.SupplyDrop_AmmoRegen SkillDefinition]
SkillName="Served with grilled meat"
SkillDescription=""
LockedSkillDetailStr="<Locked>"

[Weapon.RolandTurret_WeaponType WeaponTypeDefinition]
Typename="Semi-automatic sniper rifle"
PickupMessage="he said %s"
UseFailureLevelMessage="You must be at least %d level to use it.."
UseFailureConstraintsMessage="You cannot use this item."
NoManufacturerName="General"

